coanda_simple_pl/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

8
(
    down
    {
        type            patch;
        nFaces          145;
        startFace       88245;
    }
    right
    {
        type            patch;
        nFaces          75;
        startFace       88390;
    }
    up
    {
        type            patch;
        nFaces          145;
        startFace       88465;
    }
    meanFlow
    {
        type            patch;
        nFaces          140;
        startFace       88610;
    }
    surface
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          775;
        startFace       88750;
    }
    coandaUpper
    {
        type            patch;
        nFaces          15;
        startFace       89525;
    }
    coandaLower
    {
        type            patch;
        nFaces          15;
        startFace       89540;
    }
    defaultFaces
    {
        type            empty;
        inGroups        List<word> 1(empty);
        nFaces          88900;
        startFace       89555;
    }
)

// ************************************************************************* //
