coanda_simple_pl/system/blockMeshDict
/*---------------------------------*- C++ -*-----------------------------------*/
//    //////////////      ///////////////
//    //////////////      //////////////
//         ////           ////             /////       ////  //  /// //// ////
//         ////     ////  ///////////   ///    ///  ///    ///   ////  ///  ///
//  ////   ////           ///////////   ///    ///  ///    ///   ///   ///  ///
//   //// ////            ////          ///    ///  ///    ///   ///   ///  ///
//     /////              ////            /////       ///// ///  ///   ///  ///
/*---------------------------------*- C++ -*-----------------------------------*/

FoamFile
{
		version			2.0;
		format			ascii;
		class				dictionary;
		object			blockMeshDict;
}

// ***************************************************************************** //

scale				1;

vertices
(
		(0.2915491 0.003556 -0.078)	//	0
		(0.2915491 0.003556 0.078)	//	1
		(0.29154911 0.0037338000000000002 -0.078)	//	2
		(0.29154911 0.0037338000000000002 0.078)	//	3
		(0.29154912 0.0039838 -0.078)	//	4
		(0.29154912 0.0039838 0.078)	//	5
		(0.2715491 0.0048949 -0.078)	//	6
		(0.2715491 0.0048949 0.078)	//	7
		(0.0048949 0.0048949 -0.078)	//	8
		(0.0048949 0.0048949 0.078)	//	9
		(0.0048949 -0.0048949 -0.078)	//	10
		(0.0048949 -0.0048949 0.078)	//	11
		(0.2715491 -0.0048949 -0.078)	//	12
		(0.2715491 -0.0048949 0.078)	//	13
		(0.29154912 -0.0039838 -0.078)	//	14
		(0.29154912 -0.0039838 0.078)	//	15
		(0.29154911 -0.0037338000000000002 -0.078)	//	16
		(0.29154911 -0.0037338000000000002 0.078)	//	17
		(0.2915491 -0.003556 -0.078)	//	18
		(0.2915491 -0.003556 0.078)	//	19
		(0.0048949 -5.0 -0.078)	//	20
		(0.0048949 -5.0 0.078)	//	21
		(0.2715491 -5.0 -0.078)	//	22
		(0.2715491 -5.0 0.078)	//	23
		(0.29154913 -5.0 -0.078)	//	24
		(0.29154913 -5.0 0.078)	//	25
		(0.29154913 5.0 -0.078)	//	26
		(0.29154913 5.0 0.078)	//	27
		(0.2715491 5.0 -0.078)	//	28
		(0.2715491 5.0 0.078)	//	29
		(0.0048949 5.0 -0.078)	//	30
		(0.0048949 5.0 0.078)	//	31
		(0.0 0.0 -0.078)	//	32
		(0.0 0.0 0.078)	//	33
		(-5.0 0.0 -0.078)	//	34
		(-5.0 0.0 0.078)	//	35
		(0.2515491 0.0037338000000000002 -0.078)	//	36
		(0.2515491 0.0037338000000000002 0.078)	//	37
		(0.2515491 0.0001778 -0.078)	//	38
		(0.2515491 0.0001778 0.078)	//	39
		(0.2814145 0.0001778 -0.078)	//	40
		(0.2814145 0.0001778 0.078)	//	41
		(0.2814145 0.0037338000000000002 -0.078)	//	42
		(0.2814145 0.0037338000000000002 0.078)	//	43
		(0.2864818 0.0018669000000000001 -0.078)	//	44
		(0.2864818 0.0018669000000000001 0.078)	//	45
		(0.2864818 0.0037338000000000002 -0.078)	//	46
		(0.2864818 0.0037338000000000002 0.078)	//	47
		(0.2515491 -0.0037338000000000002 -0.078)	//	48
		(0.2515491 -0.0037338000000000002 0.078)	//	49
		(0.2515491 -0.0001778 -0.078)	//	50
		(0.2515491 -0.0001778 0.078)	//	51
		(0.2814145 -0.0001778 -0.078)	//	52
		(0.2814145 -0.0001778 0.078)	//	53
		(0.2814145 -0.0037338000000000002 -0.078)	//	54
		(0.2814145 -0.0037338000000000002 0.078)	//	55
		(0.2864818 -0.0018669000000000001 -0.078)	//	56
		(0.2864818 -0.0018669000000000001 0.078)	//	57
		(0.2864818 -0.0037338000000000002 -0.078)	//	58
		(0.2864818 -0.0037338000000000002 0.078)	//	59
);

blocks
(
		hex (16  2  0 18 17  3  1 19) (75 15 1) simpleGrading ( 1   1  1) // 6
		hex (14  4  2 16 15  5  3 17) (75 15 1) simpleGrading ( 1   1  1) // 6
		hex (24 26  4 14 25 27  5 15) (75 80 1) simpleGrading ( 1  0.0005  1) // 6
		hex (26 28  6  4 27 29  7  5) (25 80 1) simpleGrading (4  0.0005  1) // 6
		hex (28 30  8  6 29 31  9  7) (120 80 1) simpleGrading (((0.5 0.5  2) (0.5 0.5 0.1))  0.0005  1) // 7
		hex (30 34 32  8 31 35 33  9) (70 80 1) simpleGrading ( 1  0.0005  1) // 8
		hex (34 20 10 32 35 21 11 33) (70 80 1) simpleGrading ( 1  0.0005  1) // 8
		hex (20 22 12 10 21 23 13 11) (120 80 1) simpleGrading (((0.5 0.5 10) (0.5 0.5 0.5))  0.0005  1) // 9
		hex (22 24 14 12 23 25 15 13) (25 80 1) simpleGrading (0.25  0.0005  1) //10
		hex (38 40 42 36 39 41 43 37) (20 15 1) simplegrading ( 1   1  1) //11
		hex (40 44 46 42 41 45 47 43) (20 15 1) simpleGrading ( 1   1  1) //12
		hex (44  0  2 46 45  1  3 47) (20 15 1) simpleGrading ( 1   1  1) //13
		hex (48 54 52 50 49 55 53 51) (20 15 1) simpleGrading ( 1   1  1) //14
		hex (54 58 56 52 55 59 57 53) (20 15 1) simpleGrading ( 1   1  1) //15
		hex (58 16 18 56 59 17 19 57) (20 15 1) simpleGrading ( 1   1  1) //16
);

edges
(
		arc   0 18 180.0 (0 0 -1)
		arc   1 19 180.0 (0 0 -1)
		arc   2 16 180.0 (0 0 -1)
		arc   3 17 180.0 (0 0 -1)
		arc   4 14 180.0 (0 0 -1)
		arc   5 15 180.0 (0 0 -1)
		arc  30 34  90.0 (0 0  1)
		arc  31 35  90.0 (0 0  1)
		arc  34 20  90.0 (0 0  1)
		arc  35 21  90.0 (0 0  1)
		arc  32  8  90.0 (0 0 -1)
		arc  33  9  90.0 (0 0 -1)
		arc  32 10  90.0 (0 0  1)
		arc  33 11  90.0 (0 0  1)
		arc   4  6    6.418786730238787 (0 0  1)
		arc   5  7    6.418786730238787 (0 0  1)
		arc  12 14    6.418786730238787 (0 0  1)
		arc  13 15    6.418786730238787 (0 0  1)
		arc  26 24 180.0 (0 0 -1)
		arc  27 25 180.0 (0 0 -1)
		arc  40 44    36.86989764584402 (0 0  1)
		arc  44  0    36.86989764584402 (0 0 -1)
		arc  41 45    36.86989764584402 (0 0  1)
		arc  45  1    36.86989764584402 (0 0 -1)
		arc  52 56    36.86989764584402 (0 0 -1)
		arc  56 18    36.86989764584402 (0 0  1)
		arc  53 57    36.86989764584402 (0 0 -1)
		arc  57 19    36.86989764584402 (0 0  1)
);

boundary
(
    down
    {
        type patch;
        faces
        (
            (20 22 23 21)
            (22 24 25 23)
        );
    }
    right
    {
        type patch;
        faces
        (
            (24 26 27 25)
        );
    }
    up
    {
        type patch;
        faces
        (
            (26 28 29 27)
            (28 30 31 29)
        );
    }
    meanFlow
    {
        type patch;
        faces
        (
            (30 34 35 31)
            (34 20 21 35)
        );
    }

    surface
    {
        type wall;
        faces
        (
            ( 8 32 33  9)
            (32 10 11 33)
            (10 12 13 11)
            (12 14 15 13)
            (14 16 17 15)
            ( 2  4  5  3)
            ( 4  6  7  5)
            ( 6  8  9  7)
            (18  0  1 19)
            (50 52 53 51)
            (52 56 57 53)
            (56 18 19 57)
            (48 54 55 49)
            (54 58 59 55)
            (58 16 17 59)
            (36 42 43 37)
            (42 46 47 43)
            (46  2  3 47)
            (38 40 41 39)
            (40 44 45 41)
            (44  0  1 45)
        );
    }


    coandaUpper
    {
        type patch;
        faces
        (
            (36 38 39 37)
        );
    }
    coandaLower
    {
        type patch;
        faces
        (
            (48 50 51 49)
        );
    }
);
