coanda_simple_pl/system/faces
boundary
(
    down
    {
        type patch;
        faces
        (
            (20 22 23 21)
            (22 24 25 23)
        );
    }
    right
    {
        type patch;
        faces
        (
            (24 26 27 25)
        );
    }
    up
    {
        type patch;
        faces
        (
            (26 28 29 27)
            (28 30 31 29)
        );
    }
    meanFlow
    {
        type patch;
        faces
        (
            (30 34 35 31)
            (34 20 21 35)
        );
    }

    surface
    {
        type wall;
        faces
        (
            ( 8 32 33  9)
            (32 10 11 33)
            (10 12 13 11)
            (12 14 15 13)
            (14 16 17 15)
            ( 2  4  5  3)
            ( 4  6  7  5)
            ( 6  8  9  7)
            (18  0  1 19)
            (50 52 53 51)
            (52 56 57 53)
            (56 18 19 57)
            (48 54 55 49)
            (54 58 59 55)
            (58 16 17 59)
            (36 42 43 37)
            (42 46 47 43)
            (46  2  3 47)
            (38 40 41 39)
            (40 44 45 41)
            (44  0  1 45)
        );
    }


    coandaUpper
    {
        type patch;
        faces
        (
            (36 38 39 37)
        );
    }
    coandaLower
    {
        type patch;
        faces
        (
            (48 50 51 49)
        );
    }
);
